# 시리즈와 데이터 프레임 직접 만들기

## 데이터 프레임과 시리즈는 리스트나 딕셔너리와 비슷하지만 데이터를 다루는데 특화되어있다.

### 1. 시리즈 만들기

In [2]:
import pandas as pd
s = pd.Series(['apple', 33]) # 시리즈 생성
print(s)
print(type(s))

0    apple
1       33
dtype: object
<class 'pandas.core.series.Series'>

In [4]:
list_data = ['2020-04-29', 3.14, 'orajava', 100, True]
s = pd.Series(list_data) # 리스트를 시리즈로 만들기
print(s)
print(type(s))

0    2020-04-29
1          3.14
2       orajava
3           100
4          True
dtype: object
<class 'pandas.core.series.Series'>

In [5]:
dict_data = {'a':1, 'b':2, 'c':3}
s = pd.Series(dict_data) # 딕셔너리를 시리즈로 만들기 (키값이 인덱스가 됨)
print(s)
print(type(s))

a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

### 2. 시리즈 생성 - 문자열을 인덱스로 지정할 수 있다.
* 문자열을 인덱스로 지정하려면 Series메서드의 index인자를 통해 사용하고자 하는         문자열을 리스트에 담아 전달

In [6]:
s = pd.Series(['Jane', 'student'], index=['Person', 'Job']) # index 인자 사용
print(s)

Person       Jane
Job       student
dtype: object

### 3. 딕셔너리로 데이터프레임  생성하기
* 파이썬의 기본 자료구조로 데이터프레임 생성 가능
* 딕셔너리를 DataFram클래스에 전달
* 데이터프레임의 칼럼은 모두 시리즈이다.

In [3]:
scientists = pd.DataFrame({
    'Name': ['Rosaline Franklin', 'William Gosset'],
    'Occupation':['Chemist', 'Statistician'],
    'Born' : ['1920-07-25', '1876-06-13'],
    'Died' : ['1958-04-16', '1937-10-16'],
    'Age' : [37,61]}) # 딕셔너리로 5개의 시리즈로 구성된 데이터프레임 생성

scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

* columns 인자를 사용하면 데이터프레임의 열 순서를 지정할 수 있습니다.
* index, columns 지정

In [11]:
scientists = pd.DataFrame(
    data = {'Name' : ['Rosaline Franklin', 'Willam Gosset'],
        'Occupation':['Chemist', 'Statistician'],
            'Born' : ['1920-07-25', '1876-06-13'],
            'Died' : ['1958-04-16', '1937-10-16'],
            'Age' : [37,61]},
    index = ['Rosaline Franklin', 'William Gosset'], # 인덱스를 이름으로 지정
    columns = ['Occupation', 'Age', 'Born', 'Died']) # 칼럼 지정

scientists

                     Occupation  Age        Born        Died
Rosaline Franklin       Chemist   37  1920-07-25  1958-04-16
William Gosset     Statistician   61  1876-06-13  1937-10-16

In [12]:
scientists['Age']

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

### 4. 딕셔너리는 데이터의 순서를 보장하지 않는다.
* 순서가 보장된 딕셔너리를 전달하려면 OrderedDict 클래스 사용

In [32]:
from collections import OrderedDict
scientists = pd.DataFrame(OrderedDict([
    ('Name', ['Rosaline Franklin', 'William Gosset']),
    ('Occupation', ['Chemist', 'Statistician']),
    ('Born', ['1920-07-25', '1876-06-13']),
    ('Died', ['1958-04-16', '1937-10-16']),
    ('Age', [37,61])
]
)
)

scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

### 5. 데이터프레임에서 시리즈 선택하기

In [19]:
scientists = pd.DataFrame(
    data = {'Occupation':['Chemist', 'Statistician'],
            'Born' : ['1920-07-25', '1876-06-13'],
            'Died' : ['1958-04-16', '1937-10-16'],
            'Age' : [37,61]},
    index = ['Rosaline Franklin', 'William Gosset'],
    columns = ['Occupation', 'Age', 'Born', 'Died'])

In [16]:
first_row = scientists.loc['William Gosset']
print(type(first_row))

<class 'pandas.core.series.Series'>

In [17]:
first_row

Occupation    Statistician
Age                     61
Born            1876-06-13
Died            1937-10-16
Name: William Gosset, dtype: object

### 6. 시리즈 속성과 메서드
* index, values 속성과 keys 메서드 사용하기

In [18]:
# 1) index 속성 확인하기
print(first_row. index)

Index(['Occupation', 'Age', 'Born', 'Died'], dtype='object')

In [38]:
# 2) value 속성
print(first_row.values)

['Statistician' 61 '1876-06-13' '1937-10-16']

In [39]:
# 3) keys 속성 (index)
print(first_row.keys())

Index(['Occupation', 'Age', 'Born', 'Died'], dtype='object')

In [41]:
# 4) index 속성 활용
print(first_row.index[3])

Died

In [42]:
# 4) keys 메서드 속성 활용
print(first_row.keys()[0])

Occupation

### 7. 시리즈의 mean, min, max, std 메서드 사용하기

In [44]:
ages = scientists['Age']
print(ages)

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

In [45]:
print(ages.mean())

49.0

In [46]:
print(ages.max())

61

In [47]:
print(ages.std())

16.97056274847714

In [48]:
print(ages.describe()) # 요약값 .describe()

count     2.000000
mean     49.000000
std      16.970563
min      37.000000
25%      43.000000
50%      49.000000
75%      55.000000
max      61.000000
Name: Age, dtype: float64

### 8. 시리즈 다루기 응용
* 시리즈와 불린 이용하기

In [19]:
scientists = pd.read_csv('../data/scientists.csv')
#print(type(scientists))
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [20]:
df = scientists[['Name', 'Born', 'Age']] # Name, Born, Age 만 추출해서 df에 지정
print(df)

                   Name        Born  Age
0     Rosaline Franklin  1920-07-25   37
1        William Gosset  1876-06-13   61
2  Florence Nightingale  1820-05-12   90
3           Marie Curie  1867-11-07   66
4         Rachel Carson  1907-05-27   56
5             John Snow  1813-03-15   45
6           Alan Turing  1912-06-23   41
7          Johann Gauss  1777-04-30   77

In [21]:
ages = scientists['Age'] # age만 추출해서 ages에 지정
print(ages)

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [22]:
print(ages.mean())

59.125

In [23]:
print(ages[ages > ages.mean()]) # 1 - 불린추출

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [24]:
print(ages>ages.mean()) # 2

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [25]:
bool_values = [False, True, False, False, True, True, False, True] # 3
print(ages[bool_values])

1    61
4    56
5    45
7    77
Name: Age, dtype: int64

### 9. 벡터와 스칼라로 브로드캐스팅 수행하기
* 시리즈처럼 여러 개의 값을 가진 데이터 : 벡터
* 단순 크기를 나타내는 데이터 : 스칼라

In [26]:
print(ages + ages) # 벡터 더하기

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [27]:
print(ages * ages) # 벡터 곱하기

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [28]:
print(ages + 100) # 벡터에 스칼라 연산 : 브로드캐스팅한 결과

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [29]:
print(ages * 2)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [30]:
print(pd.Series([1, 100]))

0      1
1    100
dtype: int64

In [31]:
print(ages + pd.Series([1,100])) # 길이가 다른 벡터를 연산, 일치한 인덱스만 계산

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [32]:
# sort_index 인덱스 정렬
rev_ages = ages.sort_index(ascending = False) # ascending = False 내림차순
print(rev_ages)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [33]:
print(ages * 2)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [34]:
# 벡터와 벡터의 연산은 인덱스 값끼리 수행함
print(ages + rev_ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [35]:
rev_values = ages.sort_values(ascending = True)
print(rev_values)

0    37
6    41
5    45
4    56
1    61
3    66
7    77
2    90
Name: Age, dtype: int64

### 10. 데이터프레임 다루기
* 불린 추출과 브로드캐스팅

In [36]:
print(scientists[scientists['Age'] > scientists['Age'].mean()])

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [37]:
 # 데이터프레임에 2를 곱하면 정수는 *2가 되고 문자열은 2배로 늘어남
print(scientists * 2)

                                       Name                  Born  \
0        Rosaline FranklinRosaline Franklin  1920-07-251920-07-25
1              William GossetWilliam Gosset  1876-06-131876-06-13
2  Florence NightingaleFlorence Nightingale  1820-05-121820-05-12
3                    Marie CurieMarie Curie  1867-11-071867-11-07
4                Rachel CarsonRachel Carson  1907-05-271907-05-27
5                        John SnowJohn Snow  1813-03-151813-03-15
6                    Alan TuringAlan Turing  1912-06-231912-06-23
7                  Johann GaussJohann Gauss  1777-04-301777-04-30

                   Died  Age                            Occupation
0  1958-04-161958-04-16   74                        ChemistChemist
1  1937-10-161937-10-16  122              StatisticianStatistician
2  1910-08-131910-08-13  180                            NurseNurse
3  1934-07-041934-07-04  132                        ChemistChemist
4  1964-04-141964-04-14  112                    BiologistBiologist
5  1858-06-161858-06-16   90                    PhysicianPhysician
6  1954-06-071954-06-07   82  Computer ScientistComputer Scientist
7  1855-02-231855-02-23  154            MathematicianMathematician

### 11. 시리즈와 데이터프레임의 데이터 처리하기
* 1. 열의 자료형 바꾸기와 새로운 열 추가하기

In [38]:
# pandas의 object는 python의 string와 같다.
print(scientists['Born'].dtype) # Born의 데이터타입은 object
print(scientists['Died'].dtype) # Died의 데이터타입은 object

object
object

In [39]:
born_datetime = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')
print(born_datetime) # Born을 datetime 형식으로 변경

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [40]:
died_datetime = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
print(died_datetime) # Died를 datetime 형식으로 변경

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [41]:
# 새로운 열(칼럼) 추가하기
scientists['Born_dt'], scientists['Died_dt'] = (born_datetime, died_datetime)
scientists.head()

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14

In [42]:
scientists.shape

(8, 7)

In [43]:
# 새로운 열 추가하기 (날짜 계산)
scientists['age_days_dt'] = (scientists['Died_dt'] - scientists['Born_dt'])
scientists

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

### 12. 시리즈, 데이터프레임의 데이터 섞기

In [44]:
print(scientists['Age'])

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [17]:
import random
random.seed(40) # 컴퓨터가 생성하는 난수의 기준값을 설정
random.shuffle(scientists['Age'])
print(scientists['Age'])

0    61
1    37
Name: Age, dtype: int64

### 13. 데이터프레임의 열 삭제하기

In [45]:
print(scientists.columns)

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'Born_dt', 'Died_dt',
       'age_days_dt'],
      dtype='object')

In [46]:
# Age열 삭제하기
scientists_dropped = scientists.drop(['Age'], axis=1) # axis=1 열
print(scientists_dropped)

                   Name        Born        Died          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16             Chemist
1        William Gosset  1876-06-13  1937-10-16        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13               Nurse
3           Marie Curie  1867-11-07  1934-07-04             Chemist
4         Rachel Carson  1907-05-27  1964-04-14           Biologist
5             John Snow  1813-03-15  1858-06-16           Physician
6           Alan Turing  1912-06-23  1954-06-07  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23       Mathematician

     Born_dt    Died_dt age_days_dt
0 1920-07-25 1958-04-16  13779 days
1 1876-06-13 1937-10-16  22404 days
2 1820-05-12 1910-08-13  32964 days
3 1867-11-07 1934-07-04  24345 days
4 1907-05-27 1964-04-14  20777 days
5 1813-03-15 1858-06-16  16529 days
6 1912-06-23 1954-06-07  15324 days
7 1777-04-30 1855-02-23  28422 days

### 14. 데이터를 피클, CSV, TSV 파일로 저장하고 불러오기

#### 1) 피클로 저장하기

In [15]:
names = scientists['Name']

In [16]:
names.to_pickle('../output/scientists_names_series.pickle')

In [123]:
scientists.to_pickle('../output/scientists_df.pickle')

In [124]:
scientists_name_f_pickle = pd.read_pickle('../output/scientists_names_series.pickle')
scientists_name_f_pickle

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [125]:
scientists_f_pickle = pd.read_pickle('../output/scientists_df.pickle')
scientists_f_pickle

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,66,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,56,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,41,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,77,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,90,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,37,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,61,Mathematician,1777-04-30,1855-02-23,28422 days

#### 2) csv파일과 tsv 파일로 저장하기

In [135]:
names.to_csv('../output/scientists_names_series.csv')

C:\Users\has91\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

In [131]:
scientists.to_csv('../output/scientists_df.tsv', sep = '\t')

In [133]:
scientists.to_csv('../output/scientists_df_no_index.csv', index = False) # 인덱스 제외

In [134]:
# 시리즈는 to_frame() 메서드를 사용해 df로 변환 후 엑셀 파일로 저장
names_df = names.to_frame()

import xlwt
names_df.to_excel('../output/scientists_names_series_df.xls')